[
  {
    "title": "Add Live Interactive Video to Your Application with Amazon Interactive Video Service",
    "alias": "intro-to-ivs",
    "conferences": [
      {
        "name": "Connect Tech 2022",
        "date": "Nov, 2022",
        "link": "https://connect.tech",
        "recording": ""
      }
    ],
    "abstract": "In this session, we'll look at how you can use Amazon Interactive Video Service (IVS) to add live, interactive video streaming to your application with the IVS JavaScript SDK. In the first 5 months of 2022, users consumed over 543 billion minutes of live video created by almost 9 million creators on Twitch. There's no question that streaming is popular, but why is it so in-demand? Part of the draw for users is that streaming is unscripted, dynamic, and unpredictable. It's not the same old formulaic \"cookie-cutter\" content available via traditional mediums. Another attraction is the high level of interactivity with the content producer. What other medium provides live chat and interaction to viewers while they consume the content? Streaming gives the consumer a level of active participation in their entertainment instead of just passively consuming it. It's also highly accessible - anyone can set up a stream at little to no cost from the comfort of their own home or office - or anywhere as long as they have a modern mobile device and internet connectivity. But it's not just for video games - any application that needs to reach an audience can take advantage of the power of streaming to reach millions of users!"
  },
  {
    "title": "Launching Your Own Free Minecraft Server in the Cloud",
    "alias": "launching-your-own-free-minecraft-server-in-the-cloud",
    "conferences": [
      {
        "name": "CodeMash 2022",
        "date": "Jan, 2022",
        "link": "https://codemash.org",
        "recording": ""
      }
    ],
    "abstract": "Have you ever created the perfect Minecraft world and wished that you could share that world with your friends and family that don't live near you? What about customizing every single aspect of the game - mods, difficulty, weather, spawn rates, physics, landscapes, etc? You probably already know that all of that is possible by running your own custom Minecraft server. But, it can be tricky to host your own server. First, you need a spare computer lying around to host it. Then, you need to make sure that your internet firewall ports are properly configured to allow other people to connect to the server. On top of all that, your computer needs enough CPU and RAM to handle running the game server and hosting multiple connections. It can be a real pain to launch, run and manage your own Minecraft server at home! Wouldn't it be better if you could run it from a really powerful computer that is managed by someone else in a secure data center with a really fast internet connection?\n\nIn this session, we'll look at how to sign up for a completely free account in the cloud that you can use forever to host your own Minecraft server. We'll launch the server, install Minecraft and configure the firewall so that you can connect to it from your own computer and share it with your friends. We'll also talk about some basic concepts (like - what exactly is \"the cloud\") and we'll look at some other things you can do with your free account."
  },
  {
    "title": "Installing Node-RED on an ‘Always Free’ Arm Instance in the Oracle Cloud",
    "alias": "node-red-on-always-free-oci",
    "conferences": [
      {
        "name": "Node-RED Con 2021",
        "date": "",
        "link": "https://nodered.jp/noderedcon2021/index-en.html",
        "recording": ""
      }
    ],
    "abstract": "It's easy to install Node-RED on a Raspberry Pi or a spare laptop that we have lying around the house, but sometimes you need the power and flexibility of having an instance running in the cloud. Maybe you need to use it for a school or work project and need it to be accessible to the public web? In this session, I'll show you how to turn up an \"always free\" Ampere Arm instance in the Oracle Cloud and install Node-RED on that instance. We'll make sure the installation is web accessible and secure, and I'll show you a few other tips for integrating your Node-RED install into the free Oracle Cloud tier that can enable very powerful flows!"
  },
  {
    "title": "Growing in the Cloud - My Journey to Create Hot Sauce Using IoT, Messaging & Micronaut",
    "alias": "growing-in-the-cloud",
    "conferences": [
      {
        "name": "TEQNation",
        "date": "May, 2021",
        "link": "https://conference.teqnation.com/timetable-2021/",
        "recording": ""
      },
      {
        "name": "KC/DC",
        "date": "July, 2021",
        "link": "https://www.kcdc.info/",
        "recording": ""
      },
      {
        "name": "JCON",
        "date": "October, 2021",
        "link": "https://jcon.one/",
        "recording": ""
      },
      {
        "name": "CodeMash",
        "date": "Jan, 2022",
        "link": "https://codemash.org/",
        "recording": ""
      }
    ],
    "abstract": "It all started with a small project to pass the time during The Great Quarantine of 2020. I bought some chiles from the local farmer’s market (with proper face coverings and social distancing, of course), fermented my first batch of hot sauce, and shared it with a few friends around the globe. I had no idea the sauce would be such a massive success, so I resolved to build on that triumph in 2021. But this time, I knew that I would have to start from the very beginning and grow the chiles myself. Of course, this presented the wonderful opportunity to combine two of my life’s greatest passions - the culinary arts and technology - to ensure that my growth operation was the ultimate success. Join me in this session where I show you how I used a microcontroller, some sensors and the cloud to monitor and automate the germination and maturation of this year’s crop."
  },
  {
    "title": "Message Driven Microservices & Monoliths with Micronaut",
    "alias": "message-driven-microservices",
    "conferences": [
      {
        "name": "Webinar",
        "date": "March, 2021",
        "link": "https://go.oracle.com/LP=106593",
        "recording": "https://youtu.be/yOPIv3G8uSI"
      }
    ],
    "abstract": "One of the biggest challenges that developers face when working in a microservice environment is ensuring data consistency. Distributed services must be able to communicate with each other in order for your application to deliver all of the requirements and functionality that your users expect. Think about an e-commerce application, for example. Your shipment service needs to know when an order is placed, right? Your order service, in turn, should also know when it has been shipped! Even if your application is less “pure microservice” and more of a hybrid approach you probably have at least a few distributed services that ultimately need to communicate with each other. Communication between distributed services is challenging and I want to show you a few tricks for simplifying this difficult task by using Micronaut and some fairly popular messaging solutions. We’ll break this down in in this session to help you get started  implement messaging in your applications using some popular open source tools as such as Apache Kafka and RabbitMQ, well as a managed Oracle Cloud based option that can be plugged into your service with very little setup and configuration."
  },
  {
    "title": "Getting Started with JSON Document Collections in the Autonomous JSON Database",
    "alias": "intro-to-ajd",
    "conferences": [
      {
        "name": "Webinar",
        "date": "October, 2020",
        "link": "https://go.oracle.com/LP=100576?elqCampaignId=254150",
        "recording": "https://www.youtube.com/watch?v=ggkzN_OHPJs"
      }
    ],
    "abstract": "In this session, you’ll be introduced to the Autonomous JSON Database (AJD). AJD is exciting because it represents the very first time Oracle is offering a dedicated solution for JSON document collection persistence in the Oracle Cloud. It represents our commitment to offering developers tools and solutions that help them solve the problems they face when developing microservices and applications instead of trying to convince them to use a tool that might not be the best fit for them. Like all good solutions, it is scalable and adaptable, which means that it can transform into a full-blown Autonomous Transaction Processing database if your needs dictate that in the future.\n\nWe’ll get hands on in this session and show you how to launch a new AJD instance and immediately persist and retrieve JSON documents and collections via SQLcl. We’ll also show you how to use the SODA module for Node.JS to work with your AJD instance. Of course, you’re not limited to just Node.JS - we also offer SODA packages for Java, Python, C, REST and PL/SQL so you can choose the package that best fits your needs."
  },
  {
    "title": "Hidden Gems In The Oracle Cloud",
    "alias": "oci-hidden-gems",
    "conferences": [
      {
        "name": "Webinar",
        "date": "July, 2020",
        "link": "https://go.oracle.com/LP=95643",
        "recording": "https://videohub.oracle.com/media/Hidden+Gems+in+the+Cloud/1_9dfeep2q"
      }
    ],
    "abstract": "There are tons of amazing products and services in the Oracle Cloud Infrastructure catalog and I’m sure you’re using many of them in your tenancies to develop, deploy and maintain your data-driven applications. But there are also many services and features that you might not be as familiar with. \n\nIn this session, I’ll show you where to find and how to use these lesser-known features. You’ll be sure to learn a few tips for saving money on your cloud bill, ensuring compliance, manage your database instances, monitor performance and even some tips for writing more efficient code in your applications."
  },
  {
    "title": "Easier Microservice Persistence With Micronaut Data",
    "alias": "micronaut-data",
    "conferences": [
      {
        "name": "DevNexus",
        "date": "February, 2020",
        "link": "https://devnexus.com",
        "recording": ""
      }
    ],
    "abstract": "In this session I'll introduce you to Micronaut Data, a tool that will make your persistence operations easier to code and more performant than most alternatives. Writing SQL queries is one of the first things you learn as a developer which inevitably leads most developers on a quest to find the easiest, fastest and most performant way to avoid writing SQL queries. Even the simplest application likely has some form of persistence layer which means at some point you'll be thinking about writing some boring, boilerplate CRUD operations. There are many tools available to make this job easier and each of those tools have strengths and weaknesses. Micronaut Data is a new entry into the database access toolkit landscape and delivers improvements on some existing solutions by using AoT compilation to pre-compute queries which are executed by a thin runtime layer. Since the queries are pre-computed, there's no runtime model to consume memory and of course Micronaut Data doesn't use reflection or runtime proxies. The result is a toolkit that is easy to use and highly performant."
  },
  {
    "title": "Fighting Diabetes with Technology",
    "alias": "fighting-diabetes",
    "conferences": [
      {
        "name": "Oracle Code One",
        "date": "September, 2019",
        "link": "https://www.oracle.com/code-one/keynotes.html",
        "recording": "https://www.youtube.com/watch?v=HjlqoCNHGqc&list=PLU4gA5I5eLPPrKn7A1DWnlTNqERnRuIaT"
      },
      {
        "name": "DevNexus",
        "date": "February, 2020",
        "link": "https://devnexus.com",
        "recording": ""
      }
    ],
    "abstract": "My 13-year-old daughter was recently diagnosed with diabetes. She is one of 400 million people worldwide who has to live with this disease for the rest of her life—and I am determined to be with her every step of the way. Thanks to technology, I can help her to easily calculate her carbohydrate consumption to help her determine her next insulin dose. This is my attempt as a father and a developer to address a real-world problem with technology, and hopefully inspire others to do the same."
  },
  {
    "title": "How I Automated My Barn...",
    "alias": "barn-automation",
    "conferences": [
      {
        "name": "Oracle Code One",
        "date": "September, 2019",
        "link": "https://www.oracle.com/code-one",
        "recording": ""
      },
      {
        "name": "GR8Conf",
        "date": "May, 2019",
        "link": "https://gr8conf.eu/",
        "recording": ""
      },
      {
        "name": "Greach",
        "date": "March, 2019",
        "link": "https://greachconf.com",
        "recording": "https://www.youtube.com/watch?v=ce8mf4lIS-U&list=PLU4gA5I5eLPPrKn7A1DWnlTNqERnRuIaT"
      }
    ],
    "abstract": "A few years ago I created a small system to automate some tasks in our barn where we keep pet potbelly pig and our chickens.  Simple things, like scheduling when the lights turn on and off, temperature monitoring and a webcam.  It was nice to automate those things, but the best part for me was being able to tinker with the sensors and devices and learn new libraries, frameworks, and languages.  \n\nI’ve recently re-imagined the system as a way to learn more new technologies.  I’ve created a prototype version to demonstrate how I might build it again if I were to start over from scratch and in this session, we’ll look at that model and learn about the hardware and software used in it.  At its core, the system uses an Arduino, Raspberry Pi, and various pumps, solenoids, motors, and sensors to simulate the automation of certain tasks like filling a water bowl, opening and closing doors, monitoring environment and turning on and off lights on demand or via a schedule.  The hardware runs a client which has been implemented in several languages for demo purposes (currently Node and Groovy).  The client interfaces with Kafka via a cloud-based microservice (also implemented in Node and Groovy) for messaging to both store sensor data in an Autonomous Database instance and stream data to the Angular front-end in real time via server sent events. The Raspberry Pi client also receives commands for remotely performing certain tasks on demand.  The persisted data is formatted and displayed on a web application running in a Docker container that is deployed to a cloud-based Kubernetes cluster.  \n\nWe’ll look at both the hardware and software that power this system and how I’ve used the project as a playground for learning new technologies, languages, and frameworks."
  },
  {
    "title": "Getting Groovy with Spark Java",
    "alias": "getting-groovy-with-spark-java",
    "conferences": [
      {
        "name": "DevNexus",
        "date": "Feb, 2018",
        "link": "https://devnexus.com",
        "recording": "https://www.recallact.com/presentation/getting-groovy-spark-java"
      }
    ],
    "abstract": "Gone are the days of verbose, cumbersome frameworks that get in your way! Spark Java is a micro framework that is easy to learn, simple to use and makes your job as a developer easier. It can be used to create anything from a REST API microservice to a full featured web application. You can write your application or microservice using pure Java, but development gets even easier when you combine it with a the JVM language that you are most comfortable with like Kotlin or Groovy (or others). In this talk we’ll take a look at using Spark Java with Groovy. You’ll learn the basics of Spark Java and get introduced to some ways it can be extended by integrating it with the larger Java ecosystem to do things like persistence with ORM and rendering views with a variety of templating engines available. Spark Java is so lightweight you can even run it on a Raspberry Pi!"
  },
  {
    "title": "ECMA What? Getting Up To Speed With The JavaScript World",
    "alias": "ecma-what",
    "conferences": [
      {
        "name": "We RISE Tech Conference",
        "date": "June, 2018",
        "link": "https://werise.tech/",
        "recording": "https://www.recallact.com/presentation/ecma-what-getting-speed-javascript-world"
      }
    ],
    "abstract": "You've been a developer for a while. You're familiar with JavaScript and written plenty of apps in your day. But you've been out of the loop for a while. There's been a lot of changes in the JS world and after this talk you'll be up to speed and ready to get started with modern day JS."
  }
]